wrk_bench/http_go.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 2.393ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.280ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.158ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.347ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.16ms    2.82ms  70.34ms   93.39%
    Req/Sec    15.86k     4.82k   54.00k    63.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.50ms
 75.000%    2.21ms
 90.000%    3.66ms
 99.000%   14.51ms
 99.900%   33.89ms
 99.990%   49.41ms
 99.999%   58.65ms
100.000%   70.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.057     0.000000            1         1.00
       0.666     0.100000       293514         1.11
       0.891     0.200000       585532         1.25
       1.090     0.300000       878673         1.43
       1.289     0.400000      1170751         1.67
       1.498     0.500000      1463143         2.00
       1.610     0.550000      1609008         2.22
       1.732     0.600000      1755466         2.50
       1.867     0.650000      1901645         2.86
       2.024     0.700000      2047475         3.33
       2.209     0.750000      2193808         4.00
       2.323     0.775000      2267999         4.44
       2.457     0.800000      2340468         5.00
       2.627     0.825000      2413689         5.71
       2.855     0.850000      2486355         6.67
       3.173     0.875000      2559715         8.00
       3.381     0.887500      2596209         8.89
       3.663     0.900000      2632621        10.00
       4.051     0.912500      2669144        11.43
       4.539     0.925000      2705691        13.33
       5.195     0.937500      2742274        16.00
       5.587     0.943750      2760578        17.78
       6.039     0.950000      2778808        20.00
       6.559     0.956250      2797088        22.86
       7.215     0.962500      2815258        26.67
       8.039     0.968750      2833609        32.00
       8.543     0.971875      2842769        35.56
       9.143     0.975000      2851897        40.00
       9.815     0.978125      2860981        45.71
      10.639     0.981250      2870127        53.33
      11.687     0.984375      2879270        64.00
      12.311     0.985938      2883809        71.11
      13.055     0.987500      2888423        80.00
      13.927     0.989062      2892989        91.43
      14.943     0.990625      2897538       106.67
      16.223     0.992188      2902091       128.00
      17.055     0.992969      2904401       142.22
      18.031     0.993750      2906672       160.00
      19.167     0.994531      2908949       182.86
      20.575     0.995313      2911234       213.33
      22.095     0.996094      2913527       256.00
      23.007     0.996484      2914661       284.44
      24.015     0.996875      2915802       320.00
      25.151     0.997266      2916949       365.71
      26.591     0.997656      2918089       426.67
      28.255     0.998047      2919228       512.00
      29.295     0.998242      2919801       568.89
      30.287     0.998437      2920371       640.00
      31.231     0.998633      2920942       731.43
      32.575     0.998828      2921512       853.33
      34.079     0.999023      2922094      1024.00
      34.943     0.999121      2922373      1137.78
      36.031     0.999219      2922661      1280.00
      37.247     0.999316      2922946      1462.86
      38.367     0.999414      2923226      1706.67
      39.455     0.999512      2923521      2048.00
      40.095     0.999561      2923654      2275.56
      40.959     0.999609      2923797      2560.00
      41.983     0.999658      2923944      2925.71
      43.199     0.999707      2924086      3413.33
      44.671     0.999756      2924228      4096.00
      45.535     0.999780      2924297      4551.11
      46.367     0.999805      2924369      5120.00
      46.911     0.999829      2924445      5851.43
      47.743     0.999854      2924513      6826.67
      48.543     0.999878      2924582      8192.00
      49.119     0.999890      2924618      9102.22
      49.567     0.999902      2924656     10240.00
      50.047     0.999915      2924693     11702.86
      50.751     0.999927      2924726     13653.33
      51.647     0.999939      2924762     16384.00
      52.191     0.999945      2924780     18204.44
      52.543     0.999951      2924797     20480.00
      53.183     0.999957      2924815     23405.71
      53.791     0.999963      2924832     27306.67
      54.335     0.999969      2924850     32768.00
      54.623     0.999973      2924859     36408.89
      55.071     0.999976      2924868     40960.00
      55.551     0.999979      2924877     46811.43
      56.191     0.999982      2924886     54613.33
      57.311     0.999985      2924895     65536.00
      57.983     0.999986      2924899     72817.78
      58.335     0.999988      2924904     81920.00
      58.495     0.999989      2924908     93622.86
      58.943     0.999991      2924913    109226.67
      59.199     0.999992      2924917    131072.00
      59.359     0.999993      2924920    145635.56
      59.519     0.999994      2924922    163840.00
      59.647     0.999995      2924924    187245.71
      59.967     0.999995      2924926    218453.33
      60.511     0.999996      2924928    262144.00
      60.735     0.999997      2924929    291271.11
      60.927     0.999997      2924932    327680.00
      60.927     0.999997      2924932    374491.43
      60.991     0.999998      2924934    436906.67
      60.991     0.999998      2924934    524288.00
      60.991     0.999998      2924934    582542.22
      61.055     0.999998      2924935    655360.00
      61.119     0.999999      2924936    748982.86
      61.119     0.999999      2924936    873813.33
      63.743     0.999999      2924937   1048576.00
      63.743     0.999999      2924937   1165084.44
      63.743     0.999999      2924937   1310720.00
      68.863     0.999999      2924938   1497965.71
      68.863     0.999999      2924938   1747626.67
      68.863     1.000000      2924938   2097152.00
      68.863     1.000000      2924938   2330168.89
      68.863     1.000000      2924938   2621440.00
      70.399     1.000000      2924939   2995931.43
      70.399     1.000000      2924939          inf
#[Mean    =        2.157, StdDeviation   =        2.823]
#[Max     =       70.336, Total count    =      2924939]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3542985 requests in 1.00m, 7.24GB read
Requests/sec:  59048.75
Transfer/sec:    123.61MB