wrk_bench/rust_warp.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 2.129ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 43.573ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 35.313ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 16.220ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.92ms    1.12ms  22.26ms   78.16%
    Req/Sec    15.85k     3.43k   32.89k    66.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.73ms
 75.000%    2.37ms
 90.000%    3.19ms
 99.000%    6.06ms
 99.900%    9.64ms
 99.990%   13.75ms
 99.999%   19.60ms
100.000%   22.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       0.792     0.100000       292624         1.11
       1.054     0.200000       585484         1.25
       1.290     0.300000       878485         1.43
       1.511     0.400000      1170989         1.67
       1.729     0.500000      1463690         2.00
       1.842     0.550000      1609905         2.22
       1.959     0.600000      1755408         2.50
       2.085     0.650000      1902094         2.86
       2.219     0.700000      2048485         3.33
       2.373     0.750000      2194911         4.00
       2.461     0.775000      2266999         4.44
       2.563     0.800000      2340920         5.00
       2.681     0.825000      2413599         5.71
       2.823     0.850000      2487078         6.67
       2.989     0.875000      2559718         8.00
       3.085     0.887500      2596416         8.89
       3.189     0.900000      2633091        10.00
       3.305     0.912500      2669321        11.43
       3.443     0.925000      2705985        13.33
       3.613     0.937500      2742384        16.00
       3.719     0.943750      2760485        17.78
       3.847     0.950000      2778850        20.00
       3.999     0.956250      2797127        22.86
       4.179     0.962500      2815388        26.67
       4.403     0.968750      2833633        32.00
       4.543     0.971875      2842872        35.56
       4.707     0.975000      2851926        40.00
       4.895     0.978125      2861114        45.71
       5.111     0.981250      2870122        53.33
       5.375     0.984375      2879308        64.00
       5.531     0.985938      2883933        71.11
       5.703     0.987500      2888408        80.00
       5.915     0.989062      2892995        91.43
       6.159     0.990625      2897616       106.67
       6.423     0.992188      2902148       128.00
       6.583     0.992969      2904444       142.22
       6.759     0.993750      2906702       160.00
       6.971     0.994531      2908981       182.86
       7.215     0.995313      2911283       213.33
       7.495     0.996094      2913565       256.00
       7.651     0.996484      2914680       284.44
       7.835     0.996875      2915840       320.00
       8.027     0.997266      2916971       365.71
       8.287     0.997656      2918109       426.67
       8.591     0.998047      2919267       512.00
       8.767     0.998242      2919843       568.89
       8.959     0.998437      2920401       640.00
       9.183     0.998633      2920985       731.43
       9.415     0.998828      2921558       853.33
       9.671     0.999023      2922109      1024.00
       9.847     0.999121      2922394      1137.78
      10.039     0.999219      2922678      1280.00
      10.295     0.999316      2922964      1462.86
      10.551     0.999414      2923254      1706.67
      10.887     0.999512      2923543      2048.00
      11.055     0.999561      2923678      2275.56
      11.263     0.999609      2923823      2560.00
      11.479     0.999658      2923966      2925.71
      11.775     0.999707      2924107      3413.33
      12.079     0.999756      2924249      4096.00
      12.247     0.999780      2924324      4551.11
      12.423     0.999805      2924392      5120.00
      12.687     0.999829      2924465      5851.43
      12.999     0.999854      2924536      6826.67
      13.303     0.999878      2924606      8192.00
      13.495     0.999890      2924642      9102.22
      13.831     0.999902      2924678     10240.00
      14.159     0.999915      2924714     11702.86
      14.471     0.999927      2924750     13653.33
      14.839     0.999939      2924785     16384.00
      15.023     0.999945      2924804     18204.44
      15.263     0.999951      2924821     20480.00
      15.783     0.999957      2924839     23405.71
      16.751     0.999963      2924856     27306.67
      17.071     0.999969      2924874     32768.00
      17.471     0.999973      2924883     36408.89
      17.663     0.999976      2924892     40960.00
      18.095     0.999979      2924901     46811.43
      18.463     0.999982      2924910     54613.33
      18.927     0.999985      2924919     65536.00
      19.103     0.999986      2924923     72817.78
      19.279     0.999988      2924928     81920.00
      19.567     0.999989      2924932     93622.86
      19.711     0.999991      2924937    109226.67
      19.935     0.999992      2924941    131072.00
      20.079     0.999993      2924943    145635.56
      20.479     0.999994      2924946    163840.00
      20.671     0.999995      2924948    187245.71
      21.231     0.999995      2924950    218453.33
      21.503     0.999996      2924952    262144.00
      21.535     0.999997      2924953    291271.11
      21.679     0.999997      2924955    327680.00
      21.727     0.999997      2924957    374491.43
      21.727     0.999998      2924957    436906.67
      21.791     0.999998      2924958    524288.00
      21.791     0.999998      2924958    582542.22
      21.839     0.999998      2924959    655360.00
      21.903     0.999999      2924960    748982.86
      21.903     0.999999      2924960    873813.33
      21.919     0.999999      2924961   1048576.00
      21.919     0.999999      2924961   1165084.44
      21.919     0.999999      2924961   1310720.00
      22.015     0.999999      2924962   1497965.71
      22.015     0.999999      2924962   1747626.67
      22.015     1.000000      2924962   2097152.00
      22.015     1.000000      2924962   2330168.89
      22.015     1.000000      2924962   2621440.00
      22.271     1.000000      2924963   2995931.43
      22.271     1.000000      2924963          inf
#[Mean    =        1.919, StdDeviation   =        1.124]
#[Max     =       22.256, Total count    =      2924963]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3543227 requests in 1.00m, 7.17GB read
Requests/sec:  59053.43
Transfer/sec:    122.32MB